{
    "SIGCOMM_17_006": "Who is Fiddling with Prices? Building and Deploying a Watchdog Service for E-commerce",
    "SIGCOMM_17_019": "Carousel: Scalable Traffic Shaping at End-Hosts",
    "SIGCOMM_17_026": "\"Disk|Crypt|Net: rethinking the stack for high performance video streaming\"",
    "IMC_17_027": "Ethical issues of research using datasets of illicit origin",
    "HotOS_17_002": "Gray Failure: The Achilles’ Heel of Cloud-Scale Systems",
    "HotOS_17_012": "It's time to think about an Operating System for Near Data Processing Architecture",
    "HotOS_17_024": "\"Towards O(1) Memory\"",
    "HotOS_17_029": "\"Hardware is the new software\"",
    "CCS_17_011": "\"Deterministic Browser\"",
    "CCS_17_034": "Don’t Let One Rotten Apple Spoil the Whole Barrel: Towards Automated Detection of Shadowed Domains",
    "CCS_17_066": "A Stitch in Time: Supporting Android Developers in Writing Secure Code",
    "CCS_17_068": "Watch Me, but Don’t Touch Me! Contactless Control Flow Monitoring via Electromagnetic Emanations",
    "CCS_17_084": "No-Match Attacks and Robust Partnering Definitions — Defining Trivial Attacks for Security Protocols is Not Trivial",
    "CCS_17_101": "The Return of Coppersmith’s Attack: Practical Factorization of Widely Used RSA Moduli",
    "CCS_17_125": "How Unique is Your .onion? An Analysis of the Fingerprintability of Tor Onion Services",
    "CCS_17_134": "Checking Open-Source License Violation and 1-day Security Risk at Large Scale",
    "CCS_17_142": "Efficient Public Trace-and-Revoke from Standard Assumptions",
    "IPDPS_17_023": "One-Way Wave Equation Migration at Scale on GPUs using Directive-Based Programming",
    "IPDPS_17_031": "Apollo: Reusable Models for Fast and Dynamic Tuning of Input-Dependent Code",
    "IPDPS_17_042": "DC2-MTCP: Light-weight Coding for Efficient Multi-path Transmission in Data Center Network",
    "EuroPar_17_006": "Following the Blind Seer — Creating Better Performance Models Using Less Information",
    "EuroPar_17_017": "Dealing with performance unpredictability in Asymmetric Multicore Processor cloud",
    "EuroPar_17_020": "Families of Graph Algorithms : An SSSP Case Study",
    "EuroPar_17_032": "Off-Road Performance Modeling — How to Deal with Segmented Data?",
    "EuroPar_17_033": "Online dynamic monitoring of MPI communication",
    "EuroPar_17_038": "Addressing Volume and Latency Overheads in 1D-parallel Sparse Matrix Vector Multiplication",
    "EuroPar_17_039": "Improving the network of a search engine services through application-aware routing",
    "ICAC_17_005": "Hierarchical Self-Tuning of Concurrency, Resource Units in Data-Analytics Frameworks",
    "ICAC_17_011": "Deep Learning with Edge Computing for Localization of Epileptogenicity using Multimodal rs-fMRI, EEG Big Data",
    "ICAC_17_014": "Social Fusion: Integrating Twitter, Instagram for Event Monitoring",
    "ISC_17_004": "LAMMPS’PPPM Long-Range Solver for the Second Generation Xeon Phi",
    "ISC_17_007": "High-Performance Incremental SVM Learning on Intel®Xeon Phi™ Processors",
    "ISC_17_008": "Accelerating Seismic Simulations Using the Intel Xeon Phi Knight sLanding Processor",
    "ISC_17_011": "gearshifft–The FFT Benchmark Suite for Heterogeneous Platforms",
    "CLOUD_17_006": "Taming Performance Hotspots in Cloud Storage with Dynamic  Load Redistribution",
    "CLOUD_17_007": "Cloud Standards in Comparison: Are New Security Frameworks  Improving Cloud Security?",
    "PPoPP_17_006": "Synchronized-by-Default Concurrency for Shared Memory Systems",
    "CoNEXT_17_018": "Revisiting Reading Rate with Mobility: Rate-Adaptive Reading in COTS RFID System",
    "PODS_17_017": "Efficiently Enumerating Minimal Triangulation",
    "HPCA_17_010": "Application-Specific Performance-Aware Energy Optimization on Android Mobile Device",
    "HPCA_17_020": "Design and Evaluation of AWGR-based Photonic NoC Architectures for 2.5D Inegrated High Performance Computing Systems",
    "HPCA_17_036": "\"Compute Caches\"",
    "HPCA_17_041": "PipeLayer: A Pipelined ReRAM-Based Accelerator for Deep Larning",
    "HPCA_17_043": "Needle : Leveraging Program Analysis to Analyze and Extract Accelerators from Whole Programs",
    "HPCA_17_046": "G-Scalar: Cost-Effective Generalized Scalar Execution Architecture fo Power-Efficient GPUs",
    "HotCloud_17_016": "Configtron: Tackling network diversity with heterogeneous configurations.",
    "ASPLOS_17_002": "Prophet: Precise QoS Prediction on Non-Preemptive Accelerators to Improve Utilization in Warehouse Scale Computers",
    "ASPLOS_17_024": "ReFlex: Remote Flash == Local Flash",
    "NSDI_17_027": "I Can’t Believe It’s Not Causal! Scalable Causal Consistency with No Slowdown Cascades",
    "Cluster_17_002": "Contention-Aware Kernel-Assisted MPI Collectives for Multi/Many-core Systems",
    "Cluster_17_014": "QoS- and Contention- Aware Resource Provisioning in Streaming Processing Engine",
    "Cluster_17_060": "keybin Key-based Binning for Distributed Clustering",
    "HPCC_17_001": "Analysis and Modeling of the End-to-End I/O Performance in OLCF’s Titan Supercomputer",
    "HPCC_17_042": "Deep and Shallow convections in Atmosphere Models on Intel Xeon Phi Coprocessor Systems",
    "HPCC_17_056": "Block-space GPU Mapping for Embedded Sierpinski Gasket Fractals",
    "Middleware_17_014": "Rivulet: Fault-Tolerant Platform for Smart-Home Applications",
    "IISWC_17_007": "Demystifying the Characteristics of 3D-Stacked Memories: A Case Study for Hybrid Memory Cub",
    "CIDR_17_004": "Macrobase: Prioritizing Attention in fast data",
    "CIDR_17_027": "Weld: A Common Runtime for High Performance Data Analysis",
    "SIGIR_17_013": "Engaged or Frustrated? Disambiguating Emotional State in Search",
    "SIGIR_17_022": "A Probabilistic Reformulation of Memory-Based Collaborative Filtering – Implications on Popularity Biases",
    "SIGIR_17_047": "Information Retrieval Meets Game Theory: The Ranking Competition Between Documents’ Authors",
    "SIGIR_17_074": "What Are You Known For? Learning User Topical Profiles with Implicit and Explicit Footprints",
    "SIGMOD_17_028": "FPGA Based Data Partitioning",
    "SIGMOD_17_030": "Cryptanalysis of Comparable Encryption in SIGMOD’16",
    "SIGMOD_17_034": "Discovering Your Selling Points: Personalized Social Influential Tag Exploration",
    "SIGMOD_17_074": "Scalable Kernel Density Classification using Threshold-Based Pruning",
    "ICPP_17_020": "Parallel Algorithm for the Computation of Cycles in Relative Neighborhood Graphs",
    "ICPP_17_037": "Simple and Fast Parallel Algorithms for the Voronoi Maps and the Euclidean Distance Map, with GPU implementations",
    "PODC_17_005": "Distributed Learning Dynamics in Social Groups",
    "PODC_17_011": "The Multiparty Communication Complexity of Testing Triangle-Freeness",
    "PODC_17_022": "Using Time Without Clocks via Zigzag Causality",
    "PODC_17_026": "Template For Implementing Fast Lock-free Trees Using HTM",
    "PODC_17_030": "Ignore or Comply? On Breaking Symmetry in Consensus",
    "PODC_17_031": "\"Life Beyond Set Agreement\"",
    "ICPE_17_009": "On Moving Averages, Histograms and Time-Dependent Rates for Online Measurement",
    "ICPE_17_010": "AutoPerf: Automated Load Testing and Resource Usage Proﬁling of Multi-Tier Internet Applications",
    "ICPE_17_013": "A Performance-Centric Approach to Complex Decisions Support",
    "ICPE_17_019": "Analytic Models of Checkpointing for Concurrent Component-Based Software Systems ",
    "HotI_17_003": "Fast Networks and Slow Memories: A Mechanism for Mitigating Bandwidth  Mismatches",
    "CCGrid_17_024": "A Robust Tabu Search Heuristic for VM Consolidation under Demand Uncertainity in Virtualized Datacenters",
    "CCGrid_17_032": "A New File System I/O Mode for Efﬁcient User-level Caching",
    "CCGrid_17_040": "Dynamic Management of In-memory Storage for Efficiently Integrating Compute- and Data-intensive Computing on HPC Systems",
    "CCGrid_17_071": "PCSsampler: Sample based, Private-state Cluster Scheduling",
    "HPDC_17_001": "Enabling Workflow Aware Scheduling on HPC systems",
    "HPDC_17_003": "NICE: Network-Integrated Cluster Efficient Storage",
    "EuroSys_17_004": "The lock holder and the lock waiter pre-emption problems: nip them in the bud using informed spinlocks (I-Spinlocks)",
    "EuroSys_17_012": "Node.fz: Fuzzing Server-side Event-driven JavaScript",
    "EuroSys_17_015": "MOSAIC: Processing a Trillion-Edge Graph on a Single Commodity Machine",
    "KDD_17_028": "Collaboratively Improving Topic Discovery and Word Embeddings by Coordinating Global and Local Conte",
    "KDD_17_035": "\"Similarity Forests\"",
    "KDD_17_057": "PReP: Path-Based Relevance from a Probabilistic Perspective in Heteogeneous Information Networks",
    "KDD_17_061": "HyperLogLog Hyper Extended: Sketches for Concave Sublinear   Frequency Statistics",
    "SC_17_049": "\"Tessellating Stencils\"",
    "HiPC_17_012": "An X10 based Distributed Streaming Graph Database Engine",
    "HiPC_17_015": "A Novel Implementation of 2D3V Particle-In-Cell (PIC) Algorithm for Kepler GPU Architectures",
    "ISCA_17_040": "HeteroOS - OS design for heterogeneous memory management in datacenter",
    "ICDM_17_035": "\"Kernel Conditional Clustering\"",
    "SPAA_17_003": "Swarm-based Incast Congestion Control in datacenter Serving Web Applications",
    "SPAA_17_010": "Optimal Reissue Policies For Reducing Tail-Latency",
    "SPAA_17_019": "\"The Mobile Server Problem\"",
    "SPAA_17_023": "\"Matrix Multiplication, a Li le Faster\""
}